Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/design-principles_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: Since composition is central to React, we don't provide global configuration in code.
ja: コンポジションは React の中心であるため、コードでグローバル設定を提供しません。

source: We do, however, provide some global configuration on the build level.
ja: ただし、ビルドレベルでグローバル設定をいくつか提供します。

source: For example, we provide separate development and production builds.
ja: たとえば、開発ビルドと本番ビルドを別々に提供しています。

source: We may also [add a profiling build](https://github.com/facebook/react/issues/6627) in the future, and we are open to considering other build flags.
ja: 将来[プロファイリングビルドを追加する](https://github.com/facebook/react/issues/6627)かもしれませんし、また、他のビルドフラグの検討を受け入れています。

source: ### Beyond the DOM {#beyond-the-dom}
ja: ### DOM を超えて {#beyond-the-dom}

source: We see the value of React in the way it allows us to write components that have fewer bugs and compose together well.
ja: 私たちは React の価値を、バグの少ないコンポーネントを書いてうまく構成することができるという点に見ています。

source: DOM is the original rendering target for React but [React Native](https://reactnative.dev/) is just as important both to Facebook and the community.
ja: DOM は React のオリジナルのレンダーターゲットですが、[React Native](https://reactnative.dev/) は Facebook とコミュニティの両方において同じくらい重要です。

source: Being renderer-agnostic is an important design constraint of React.
ja: レンダラーに依存しないことは React の重要な設計上の制約です。

source: It adds some overhead in the internal representations.
ja: それは内部表現にいくらかのオーバーヘッドを追加します。

source: On the other hand, any improvements to the core translate across platforms.
ja: その一方で、コアへの改善はすべてのプラットフォームに行きわたります。

source: Having a single programming model lets us form engineering teams around products instead of platforms.
ja: 単一のプログラミングモデルを持つことで、プラットフォームではなく製品を中心にエンジニアリングチームを形成できます。

source: So far the tradeoff has been worth it for us.
ja: これまでのところ、そのトレードオフは私たちにとって価値があります。

source: ### Implementation {#implementation}
ja: ### 実装 {#implementation}

source: We try to provide elegant APIs where possible.
ja: 可能な限り洗練された API を提供しようとしています。

source: We are much less concerned with the implementation being elegant.
ja: しかし実装がエレガントであることにはそれほど関心がありません。

source: The real world is far from perfect, and to a reasonable extent we prefer to put the ugly code into the library if it means the user does not have to write it.
ja: 現実の世界は完璧には程遠いので、ユーザが醜いコードを書かなくて済むのであれば、合理的な範囲で醜いコードをライブラリに入れることを選びます。

source: When we evaluate new code, we are looking for an implementation that is correct, performant and affords a good developer experience.
ja: 新しいコードを評価するときには、正しく、パフォーマンスが高く、優れた開発者体験を提供する実装を求めます。

source: Elegance is secondary.
ja: 優雅さは二の次です。

source: We prefer boring code to clever code.
ja: 私たちは賢いコードより退屈なコードを好みます。

source: Code is disposable and often changes.
ja: コードは使い捨てであり、しばしば変更されます。

source: So it is important that it [doesn't introduce new internal abstractions unless absolutely necessary](https://youtu.be/4anAwXYqLG8?t=13m9s).
ja: したがって、それが[絶対に必要でない限り、新しい内部抽象化を導入しない](https://youtu.be/4anAwXYqLG8?t=13m9s)ことが重要です。

source: Verbose code that is easy to move around, change and remove is preferred to elegant code that is prematurely abstracted and hard to change.
ja: 移動、変更、削除が容易な冗長コードは、時期尚早に抽象化され変更が難しいエレガントなコードよりも優先されます。

source: ### Optimized for Tooling {#optimized-for-tooling}
ja: ### ツールへの最適化 {#optimized-for-tooling}

source: Some commonly used APIs have verbose names.
ja: いくつかの一般的に使用される API は冗長な名前を持っています。

source: For example, we use `componentDidMount()` instead of `didMount()` or `onMount()`.
ja: 例えば、`didMount()` や `onMount()` の代わりに `componentDidMount()` を使います。

source: This is [intentional](https://github.com/reactjs/react-future/issues/40#issuecomment-142442124).
ja: これは[意図的](https://github.com/reactjs/react-future/issues/40#issuecomment-142442124)です。

source: The goal is to make the points of interaction with the library highly visible.
ja: 目的は、ライブラリとのやり取りのポイントをよく見えるようにすることです。

source: In a massive codebase like Facebook, being able to search for uses of specific APIs is very important.
ja: Facebook のような大規模なコードベースでは、特定の API の使用を検索できることが非常に重要です。

source: We value distinct verbose names, and especially for the features that should be used sparingly.
ja: 他と区別しやすい冗長な名前を大切にしています。特に、控えめに使用する必要がある機能についてはそれが重要です。

source: For example, `dangerouslySetInnerHTML` is hard to miss in a code review.
ja: 例えば、`dangerouslySetInnerHTML` をコードレビューで見逃すことは難しいでしょう。

source: Optimizing for search is also important because of our reliance on [codemods](https://www.youtube.com/watch?v=d0pOgY8__JM) to make breaking changes.
ja: 私たちは破壊的な変更を加える際に [codemods](https://www.youtube.com/watch?v=d0pOgY8__JM) に依存しているため、検索を最適化することも重要です。

source: We want it to be easy and safe to apply vast automated changes across the codebase, and unique verbose names help us achieve this.
ja: 膨大な自動化された変更をコードベース全体に適用するのが簡単で安全であることを望みます。区別しやすい冗長な名前を使用すると、これを実現できます。

source: Similarly, distinctive names make it easy to write custom [lint rules](https://github.com/yannickcr/eslint-plugin-react) about using React without worrying about potential false positives.
ja: 同様に、他と区別可能な名前を使用すると、潜在的な誤検知を心配することなく、React の使用に関するカスタムの [lint ルール](https://github.com/yannickcr/eslint-plugin-react)を簡単に作成できます。

source: [JSX](/docs/introducing-jsx.html) plays a similar role.
ja: [JSX](/docs/introducing-jsx.html) も同様の役割を果たします。

source: While it is not required with React, we use it extensively at Facebook both for aesthetic and pragmatic reasons.
ja: React では必須ではありませんが、美観上および実用上の理由から、Facebook で広く使用されています。

source: In our codebase, JSX provides an unambiguous hint to the tools that they are dealing with a React element tree.
ja: 私たちのコードベースでは、JSX はそれらが React 要素ツリーを扱っているというツールへの明白なヒントを提供します。

source: This makes it possible to add build-time optimizations such as [hoisting constant elements](https://babeljs.io/docs/en/babel-plugin-transform-react-constant-elements/), safely lint and codemod internal component usage, and [include JSX source location](https://github.com/facebook/react/pull/6771) into the warnings.
ja: これにより、[定数要素の巻き上げ](https://babeljs.io/docs/plugins/transform-react-constant-elements/)、安全な lint および codemod 内部コンポーネントの使用などのビルド時の最適化を追加したり、[JSX ソースの場所](https://github.com/facebook/react/pull/6771)を警告に含めることができます。

source: ### Dogfooding {#dogfooding}
ja: ### ドッグフーディング {#dogfooding}

source: We try our best to address the problems raised by the community.
ja: 私たちはコミュニティーによって提起された問題に取り組むために最善を尽くします。

source: However we are likely to prioritize the issues that people are *also* experiencing internally at Facebook.
ja: しかし、私たちは Facebook *も*内部で経験している問題を優先する可能性があります。

source: Perhaps counter-intuitively, we think this is the main reason why the community can bet on React.
ja: 直感に反するかもしれませんが、私たちはこれこそがコミュニティが React に賭けることができる主な理由であると思います。

source: Heavy internal usage gives us the confidence that React won't disappear tomorrow.
ja: 大量に内部で使用していることで、React が明日消えないという自信が得られます。

source: React was created at Facebook to solve its problems.
ja: React は Facebook の問題を解決するために Facebook で作成されました。

source: It brings tangible business value to the company and is used in many of its products.
ja: それは Facebook に確かなビジネス価値をもたらし、多くの製品で使用されています。

source: [Dogfooding](https://en.wikipedia.org/wiki/Eating_your_own_dog_food) it means that our vision stays sharp and we have a focused direction going forward.
ja: [ドッグフーディング](https://en.wikipedia.org/wiki/Eating_your_own_dog_food)によって、私たちのビジョンが鮮明なままであり、私たちが今後も焦点を絞った方向性を持てるようになります。

source: This doesn't mean that we ignore the issues raised by the community.
ja: これは、コミュニティが提起した問題を無視しているという意味ではありません。

source: For example, we added support for [web components](/docs/webcomponents.html) and [SVG](https://github.com/facebook/react/pull/6243) to React even though we don't rely on either of them internally.
ja: たとえば、Facebook 内部で依存していないにも関わらず、React に [Web Components](/docs/webcomponents.html) および [SVG](https://github.com/facebook/react/pull/6243) のサポートを追加しました。

source: We are actively [listening to your pain points](https://github.com/facebook/react/issues/2686) and [address them](/blog/2016/07/11/introducing-reacts-error-code-system.html) to the best of our ability.
ja: 私達は積極的に[皆さんの問題点を聞き](https://github.com/facebook/react/issues/2686)、私たちの能力の及ぶ限りで[それらに対処](/blog/2016/07/11/introducing-reacts-error-code-system.html)します。

source: The community is what makes React special to us, and we are honored to contribute back.
ja: コミュニティは React を私たちにとって特別なものにしており、私たちもお返しとして喜んでコミュニティに貢献したいと考えています。

source: After releasing many open source projects at Facebook, we have learned that trying to make everyone happy at the same time produced projects with poor focus that didn't grow well.
ja: Facebook で多くのオープンソースプロジェクトをリリースした後、みんなを同時に幸せにすることを試みるが焦点が不十分なプロジェクトを生み出してもうまく成長しないということを学びました。

source: Instead, we found that picking a small audience and focusing on making them happy brings a positive net effect.
ja: 代わりに、少人数の観客を選んで満足させることに集中すると最終的には良い効果があることがわかりました。

source: That's exactly what we did with React, and so far solving the problems encountered by Facebook product teams has translated well to the open source community.
ja: これこそまさに私たちが React を使って行ったことであり、そして今のところ Facebook 製品チームが遭遇した問題を解決することは、オープンソースコミュニティにもうまく還元されています。

source: The downside of this approach is that sometimes we fail to give enough focus to the things that Facebook teams don't have to deal with, such as the "getting started" experience.
ja: このアプローチの欠点は、React の初期体験の良し悪しなど、Facebook チームが対処する必要がないことに十分に焦点を当てることができないことです。

source: We are acutely aware of this, and we are thinking of how to improve in a way that would benefit everyone in the community without making the same mistakes we did with open source projects before.
ja: 私たちはこのことを強く認識しており、以前にオープンソースプロジェクトで行ったのと同じ過ちを犯さずに、コミュニティのすべての人に利益をもたらすようなやり方でどのような改善ができるかを考えています。
